In [19]:
import pandas as pd
df = pd.read_csv('gender_submission.csv', sep=',')
df_res = pd.read_csv('test.csv', sep=',')

In [20]:
df.columns

Index(['PassengerId ', 'Survived'], dtype='object')

In [21]:
df_res.columns

Index(['PassengerId ', 'Pclass ',
       'Name                                                              ',
       'Sex    ', 'Age  ', 'SibSp ', 'Parch ', 'Ticket             ',
       'Fare     ', 'Cabin           ', 'Embarked'],
      dtype='object')

In [22]:
age_df = df_res[['PassengerId ',"Age  "]]

In [23]:
merged_df = pd.merge(age_df, df, on="PassengerId ")

In [24]:
merged_df

     PassengerId   Age    Survived
0             892  34.5          0
1             893  47            1
2             894  62            0
3             895  27            0
4             896  22            1
..            ...    ...       ...
413          1305                0
414          1306  39            1
415          1307  38.5          0
416          1308                0
417          1309                0

[418 rows x 3 columns]

In [25]:
merged_df.drop(['PassengerId '], axis=1, inplace=True)

In [26]:
merged_df

     Age    Survived
0    34.5          0
1    47            1
2    62            0
3    27            0
4    22            1
..     ...       ...
413                0
414  39            1
415  38.5          0
416                0
417                0

[418 rows x 2 columns]

In [27]:
merged_df.to_csv('titanic_age_survived.csv', index=False)

In [29]:
merged_df.isna().sum()

Age         0
Survived    0
dtype: int64

In [36]:
import pandas as pd
df = pd.read_csv('titanic_age_survived.csv', sep=',')
df.drop(df.index[df["Age  "] == ""], inplace=True)
# df["Age  "] = df["Age  "].astype(int, errors='ignore')
df[8:12]

    Age    Survived
8   18            1
9   21            0
10                0
11  46            0

In [23]:
syms = ["", "NaN", " ", "  "]
for sym in syms:
    df.drop(df.index[df["Age  "] == sym], inplace=True)
df

# df.drop(df[df["Age  "] in  ["", "NaN", " ", "  "].bool].index, inplace=True)

     Age    Survived
0    34.5          0
1    47            1
2    62            0
3    27            0
4    22            1
..     ...       ...
413                0
414  39            1
415  38.5          0
416                0
417                0

[418 rows x 2 columns]

In [26]:
df[10:11]

    Age    Survived
10                0

In [39]:
age_list = []
sur_list = []
with open('titanic_age_survived.csv', 'r') as f:
    for line in f.readlines():
        age, survived = line.split(',')
        try:
            int(age)
            age_list.append(int(age))
            sur_list.append(int(survived))
        except:
            pass

312

In [40]:
df = pd.DataFrame({'Age': age_list, 'Survived': sur_list})

In [41]:
df.head()

   Age  Survived
0   47         1
1   62         0
2   27         0
3   22         1
4   14         0

In [42]:
df.to_csv('titanic_age_survived.csv', index=False)